<!DOCTYPE html>
<html>
<head>
	<title>qgelena</title>
	<meta charset="utf-8">
	<link rel='stylesheet' href='/static/style.css'/>
	<meta name='keywords' content='biology, Python, bioinfirmatics, testing, QA' charset='utf-8'/>
	<meta name='description' content="">
	<meta name='author' content="Alona Sychevska">
</head>
<body>
<header class='site-header'>
	<h1 id="title_header">other</h1>
<?php 
include('../include/header.php');
?>
</header>
<div class="page_content">
	<aside class="inline-tbl aside-size">
	</aside>
	<section id="text" class="inline-tbl"> 
		<p>
			<b>Десять приемов, которые помогут улучшить презентацию PowerPoint</b><br/>
			<i>Хелен Брэдли</i><br/>
			<strong>«Мир ПК»</strong><br/>
		</p>
		<p>
			Helen Bradley. 10 Secrets to Punch Up Your PowerPoint Presentations. <a href="http://www.pcworld.com/article/253860/10_secrets_to_punch_up_your_powerpoint_presentations.html">www.pcworld.com</a><br/>
		</p>
		<p>
			Приложение PowerPoint уже давно превратилось практически в синоним презентаций. У этой программы есть все необходимые инструменты для демонстрации профессионально сделанного слайд-шоу, снабженного аудио- и видеофрагментами, а также анимацией. Однако некоторые функции, с помощью которых можно создавать блестящие презентации, глубоко спрятаны в недрах интерфейса PowerPoint. Мы познакомим вас с целым рядом секретов PowerPoint.<br/>
		</p>
		<p>	
			<strong>1. Поэтапное отображение диаграммы</strong><br/>
		</p>
		<p>	
			Диаграмма на слайде гораздо эффектнее будет  выглядеть  в пошаговом режиме, когда ее ряды выводятся на экран не одновременно, а последовательно.<br/>
			<!--Теги <b> i <strong>, <i> i <em> різняться сементикою, <b> i <i> роблять текст жирним чи курсивним, а <strong> i <em> роблять текст жирним і курсивним за замовчуванням, але в css ми можемо сказати як саме ми його хочемо виділяти, наприклад, червоним кольором, чи додати квіточок, котиків і тд.-->
		</p>
		<p>	
			Это легко  сделать  в среде PowerPoint, применив функцию  анимации.<br/>
			Выделите диаграмму и перейдите на вкладку «Анимация»,  находящуюся на  панели.  Выберите пункт «Область анимации».  В правой части окна приложения откроется дополнительная панель. Нажмите кнопку  «Добавить анимацию»  и в области «Вход»  выберите анимационный эффект,  например «Выцветание».<br/>
		</p>	
			<img src="../static/img1.jpg" alt="presentation" width="550" height="450" /><br/>
		<p>
			<em>PowerPoint автоматически разделяет процесс отображения диаграммы на несколько этапов. Отдельные области диаграммы появляются на экране не одновременно, а в определенной последовательности</em><br/> 
 		</p>
 		<p>	
 			На панели «Область анимации»  щелкните правой кнопкой мыши  на элементе, появившемся  там после добавления эффекта. Выберите из контекстного меню пункт  «Параметры эффектов»  и перейдите на вкладку  «Анимация диаграммы».  По умолчанию параметр «Группировка диаграммы»  принимает значение  «Как  один  объект».  В этом случае все элементы диаграммы отображаются на экране одновременно. Чтобы  последовательно  выводить ряды,  выберите из  ниспадающего  меню пункт  «По рядам».  Ряды будут отображаться один за другим с некоторой задержкой. При выборе пункта  «По категориям»  на каждом этапе на экран будет выводиться очередная категория. Установите флажок  «Запустить анимацию»,  нарисовав фон диаграммы, и перейдите на вкладку  «Время».  Для автоматического запуска анимации при отображении на экране слайда для параметра  «Начало» установите  значение 
 			«После предыдущего».<br/> 
 		</p>
 		<p>	
			Задайте скорость отображения анимации, выбрав нужное значение в списке  "Продолжительность".  Нажмите OK и выполните предварительный просмотр анимации, щелкнув  на  кнопке  «Просмотр»  в верхней части панели  «Область анимации».<br/>
		</p>
		<p>	
			<strong>2. Отображение картинки в нужный момент</strong><br/>
		</p>
		<p>	
			Нередко у авторов презентаций возникает желание спрятать картинку, находящуюся на слайде, с  тем  чтобы открыть ее в нужный момент.  Чтобы проделать это, нужно привязать  изображение к  фигуре. А затем следует настроить  параметры таким образом, чтобы после  того,  как вы щелкните  на  фигуре мышью, картинка отобразилась на экране.  Добавьте на слайд изображение и вставьте  ту  фигуру, щелчок  на  которой приведет к отображению картинки. На вкладке «Вставка»  нажмите кнопку  «Фигуры».  Выберите какую-нибудь фигуру, например  «Овал»,  и нарисуйте ее на слайде. Щелкните  на  фигуре правой кнопкой мыши, выберите из контекстного меню пункт «Изменить текст»  и введите какую-нибудь фразу,  например «Щелкни на мне!»<br/>
		</p>
		<p>	
			Выделите изображение, перейдите на вкладку  «Анимация»  и нажмите кнопку  «Добавить анимацию».  Укажите вид анимации, например «Масштабирование».  Выведите на экран панель  «Область анимации»,  нажав соответствующую этому названию кнопку.  Щелкните правой кнопкой мыши  на элементе, находящемся  в  «Области анимации»,  и выберите из контекстного меню пункт «Время».  Нажмите кнопку  «Переключатели»  и установите переключатель в положение  «Начать  выполнение эффекта при  щелчке».  В  ниспадающем  списке выберите название созданной вами фигуры. Нажмите OK.<br/>
		</p>
		<p>	
			Для просмотра полученного эффекта перейдите на  ленте  на вкладку «Показ слайдов»  и нажмите кнопку «С текущего слайда». В момент вывода слайда на экран картинка на нем не  отображается, она  появляется лишь после того, как вы щелкните мышью  на  фигуре.<br/>
		</p>
		<p>	 
			<img src="../static/img2.jpg" alt="presentation" width="550" height="450" /><br/>
		</p>
		<p>	
			<em>С помощью функции «Переключатели» можно вывести  изображение на экран, щелкнув мышью  на  созданной для  этого фигуре</em><br/>
		</p>
		<p>	
			<strong>3. Cоздание стилей презентации с помощью  «Образца слайдов»</strong><br/>
		</p>
		<p>	 
			Наверное, вы уже знакомы с использованием в Microsoft Word и Publisher стилей, предназначенных для единообразного форматирования текста в документе. Хотя PowerPoint и не поддерживает стилей, аналогичные операции  поможет  выполнить  функция «Образец слайдов». Если вы внесете в нее изменения, то измените  форматирование текста на всех слайдах одновременно.
			Чтобы перейти в этот режим, перейдите на  панели  на вкладку  «Просмотр»  и нажмите кнопку  «Образец слайдов». Слева на экране  откроется меню, в верхней части которого будет представлен  «Образец слайдов»,  а ниже  будут размещены  доступные схемы их компоновки.<br/>
		</p>
		<p>	
			Чтобы  привести  текст  к требующемуся виду,  выберите на  «Образце слайдов»  соответствующий элемент. К примеру,  если нужно  изменить форматирование заголовков, выделите текст заголовка и настройте его  так, как вам хочется.  Здесь  допустимо  изменять как отдельные стили текста, так и сразу все стили.<br/>
		</p>
		<p>	
			Потом  перейдите на вкладку  «Образцы слайдов»  и нажмите кнопку  «Закрыть  режим  образца»,  чтобы вернуться к редактированию презентации. Внесенные изменения автоматически отобразятся на всех слайдах презентации, а форматирование  «Образца слайдов»  будет применяться ко всем новым слайдам.<br/>
		</p>
		<p>	
			<img src="../static/img3.jpg" alt="presentation" width="550" height="450" /><br/>
		</p>
		<p>	
			<em>«Образец слайдов»  управляет форматированием текста на всех слайдах презентации. Его можно настроить  по своему желанию</em> 
		<p>	
			<strong>4. Просмотр презентации в  «Режиме чтения»</strong><br/> 
		</p>
		<p>	
			В версии PowerPoint 2010 появился новый  «Режим чтения».  Эта удобная функция позволяет просматривать и тестировать презентацию в среде PowerPoint в полноэкранном режиме.  Чтобы вызвать ее,  перейдите на вкладку  «Просмотр»  и нажмите кнопку  «Режим чтения».  Среда редактирования исчезнет, а вместо нее на экране появится слайд-шоу, начиная с первого слайда.
			Пролистав всю презентацию, вы получите представление о том, как она выглядит. После просмотра последнего слайда нажмите клавишу  <cтрелка вправо>,  чтобы выйти из режима чтения. Кроме того,  пользователь может  в любой момент вернуться в режим редактирования  PowerPoint, нажав  клавишу  <Esc>. 
		</p>	
			<img src="../static/img4.jpg" alt="presentation" width="550" height="450" /><br/>
		<p>	
			<em>Режим чтения PowerPoint 2010 – удобное средство просмотра презентаций</em> 
		</p>
		<p>	
			<strong>5. Настройка автоматической демонстрации</strong>
		</p>
		<p>	
			PowerPoint – отличный инструмент для создания слайд-шоу и его автоматической демонстрации на стенде компании во время торговой выставки. Для этого нужно задать автоматический режим воспроизведения, в котором слайды будут циклически сменять друг друга до получения команды на завершение презентации.<br/>
		</p>
		<p>	
			Чтобы перейти в режим автоматической презентации, щелкните на  вкладке  «Показ слайдов»  и нажмите кнопку  «Настройка демонстрации».  Установите переключатель  «Показ слайдов»  в положение «автоматический (полный экран)». Переключатель  «Смена слайдов»  установите в положение «по времени». Нажмите OK.<br/>
		</p>
		<p>	
			Выберите на  ленте  вкладку  «Переходы».  В разделе  «Смена слайда»  установите флажок  «После»  и укажите время (например, в случае установки значения 00:05,00 каждый слайд будет отображаться в течение 5  с).  Нажмите кнопку  «Применить  ко  всем»,  чтобы указанный переход затронул все слайды презентации. Теперь при воспроизведении презентации слайды будут автоматически сменять друг друга через каждые  5 с.  По достижении последнего слайда цикл демонстрации повторится. Чтобы завершить показ, нажмите  <Esc>.<br/>
		</p>	
			<img src="../static/img5.jpg" alt="presentation" width="550" height="450" /><br/>
		<p>	
			<em>Во время торговой выставки можно настроить презентацию таким образом,  чтобы ее воспроизведение осуществлялось автоматически.  После демонстрации последнего слайда цикл воспроизведения будет  повторяться</em><br/>
		</p>	
		<p>	
			<strong>6. Повторное использование слайдов другой презентации</strong><br/>
		</p>
		<p>	
			При демонстрации слайд-шоу вам, возможно, понадобится слайд, уже  имеющийся  в одной из ранее созданных  презентаций, например  слайд, представляющий ключевых сотрудников вашей компании или информацию о  контактах. Чтобы повторно использовать такой контент,  импортируйте существующие слайды в текущую презентацию.<br/>
		</p>
		<p>	
			Перейдите на основной панели на вкладку «Главная» и в меню «Создать слайд» выберите пункт «Повторное использование слайдов». На панели «Повторное  использование  слайдов» нажмите кнопку «Обзор», выберите пункт «Поиск файла» и укажите презентацию PowerPoint, содержащую те  слайды, которые вы хотели бы применять. Список слайдов отобразится на дополнительной панели в правой части экрана. Чтобы увеличить слайд, подведите  к  нему указатель мыши.  Щелкните  на слайде,  который должен быть добавлен в новую презентацию. PowerPoint изменит его формат, чтобы он соответствовал стилю презентации. Если вы предпочитаете использовать форматирование оригинальной презентации, перед выполнением процедуры импорта установите флажок «Сохранить  исходное  форматирование», расположенный в нижней части панели «Повторное использование слайдов».
		</p>	
			<img src="../static/img6.jpg" alt="presentation" width="550" height="450" /><br/>
		<p>
			<em>Функция повторного использования слайдов позволяет импортировать слайды из других презентаций, сохраняя их форматирование
			в неизменном виде или приводя его к стилю новой  презентации</em> 
		</p>	
		<p>	
			<strong>7. Быстрое создание фотоальбома</strong><br/>
		</p>
		<p>	
			PowerPoint идеально подходит для  того, чтобы создавать фотоальбомы, использующиеся  в  каталогах, а также  при рекламировании новых товаров. Для выполнения  презентации в альбомном стиле предварительно нужно настроить конфигурацию фотоальбома. Оставшаяся часть презентации выстраивается в соответствии с ранее определенными параметрами. Такой порядок обусловлен тем, что функция  «Фотоальбом»  совершенно  по-новому представляет изображения. 
		</p>		
		<p>	
			На  верхней панели  перейдите на вкладку  «Вставка»  и щелкните  на  кнопке  «Фотоальбом».  В появившемся на экране диалоговом окне нажмите кнопку  «Файл  или  диск», выберите  изображения для фотоальбома  и щелкните  на  кнопке  «Вставить».  Порядок размещения изображений на слайде определяется параметром  «Разметка рисунка».  При этом внешний вид слайда отображается в поле предварительного просмотра. Указанные параметры будут применяться ко всем слайдам в альбоме.
		</p>		
		<p>	
			Можно настроить и другие параметры, например форму рамки. По окончании настройки нажмите кнопку  «Создать»,  и PowerPoint построит новую презентацию, добавив туда выбранные изображения и упорядочив их. Теперь можно отредактировать отдельные слайды, перемещая изображения и изменяя их размеры. Кроме того,  допустимо  добавить в презентацию и другие слайды.
		</p>	
			<img src="../static/img7.jpg" alt="presentation" width="550" height="450" /><br/>
		<p>
			<em>Функция  «Фотоальбом»  позволяет быстро разместить на слайдах много  изображений</em> 
		</p>	
		<p>	
			<strong>8. Ссылка на веб-сайт</strong><br/>
		</p>
		<p>	
			В презентации можно создать ссылку на веб-сайт. При переходе на нее в среде браузера  откроется  заданный сайт.
			Откройте вкладку  «Вставка»  и нажмите кнопку  «Фигуры».  Нарисуйте на слайде любую фигуру по своему выбору. Щелкните  на  фигуре правой кнопкой мыши, выберите из контекстного меню пункт  «Изменить текст»  и введите строку, которая  послужит ссылкой  на сайт. Не снимая выделения с фигуры, нажмите на вкладке  «Вставка» кнопку «Действие»  и перейдите на вкладку  «По  щелчку  мыши».  Установите переключатель  «Действие  по щелчку мыши»  в положение  «Перейти  по  гиперссылке»  и выберите из  ниспадающего  меню пункт «Адрес URL».  В окне  «Гиперссылка  на адрес  URL»  введите полный веб-адрес и нажмите OK. Если во время проведения презентации компьютер подключен к Интернету, после щелчка мышью  на  фигуре на экране появится браузер, заданный в системе по умолчанию, с открытым в нем веб-сайтом.
		</p>	
			<img src="../static/img8.jpg" alt="presentation" width="550" height="450" /><br/>
		<p>
			<em>PowerPoint позволяет создать фигуру, щелкнув  на  которой вы запустите Internet Explorer и отобразите в нем определенный в презентации веб-сайт</em> 
		</p>	
		<p>	
 			<strong>9. Музыкальное сопровождение слайд-шоу</strong><br/>
 		</p>
 		<p>	
			С момента появления первой версии PowerPoint настройка музыкального сопровождения демонстрации серии слайдов  представляла  собой весьма непростую задачу. И PowerPoint 2010 не  стал  в этом смысле исключением. Настройки соответствующих параметров спрятаны в приложении  в тех местах,  где многим и в голову не придет их искать.
		</p>
		<p>	
			Чтобы  в процессе демонстрации слайдов  воспроизводилась музыка,  щелкните мышью  на слайде,  с которого должно начинаться музыкальное сопровождение. На  ленте  перейдите на вкладку  «Вставка»,  нажмите кнопку  «Звук»  и выберите нужный аудиофайл. Выделите на слайде музыкальный трек и в разделе  «Работа  со  звуком»  перейдите на вкладку  «Воспроизведение».  В  ниспадающем  списке  «Начало»  выберите пункт «Для  всех слайдов».  Теперь музыка будет сопровождать презентацию, пока та не завершится.
		</p>
		<p>	
			<img src="../static/img9.jpg" alt="presentation" width="550" height="450" /><br/>
		</p>	
			<em>Параметр  «Начало»  позволяет настроить музыкальное сопровождение сразу для всех  слайдов</em>
		<p>	
			<strong>10. Трансляция презентации в Интернете</strong><br/>
		</p>
		<p>	
			При организации телеконференции PowerPoint 2010 позволяет транслировать слайд-шоу в Интернете. После завершения работы над документом .pptx выберите в меню  «Файл»  пункт  «Сохранить  и  отправить».  В появившемся на экране меню выберите пункт  «Широковещательный  показ  слайдов»  и нажмите кнопку  «Широковещательный  показ  слайдов».  В диалоговом окне щелкните  на  кнопке  «Начать  широковещательный  показ»  и введите свои учетные данные Windows Live ID. Вы получите ссылку на презентацию, которую можно разослать по электронной почте или, скажем, через систему мгновенной передачи сообщений, приглашая выбранных вами людей к просмотру презентации.<br/>
		</p>
		<p>	
			Когда все участники соберутся у мониторов, нажмите кнопку  «Начать  показ  слайдов».  Презентация будет транслироваться в широковещательном режиме, а на экранах участников конференции будут отображаться демонстрируемые вами слайды. Правда, звуковое сопровождение возможно лишь при использовании отдельного сервиса аудиоконференций. По окончании презентации нажмите кнопку  «Завершить  широковещательный  показ».  Все участники будут автоматически отключены, и трансляция презентации завершится.
		</p>	
			<img src="../static/img10.jpg" alt="presentation" width="550" height="450" /><br/>
		<p>	
			<em>PowerPoint 2010 позволяет организовать широковещательную трансляцию  презентации в  Интернете</em><br/>
		</p>
	</section>
	<aside class="inline-tbl aside-size">
	</aside>	
</div>	
<?php 
include('../include/footer.php');
?>
</body>
</html>
